sbatch-INFO: start of job
sbatch-INFO: nodes: n3
sbatch-INFO: system: phoebe
Mathematica 13.3.0 Kernel for Linux x86 (64-bit)
Copyright 1988-2023 Wolfram Research, Inc.

In[1]:= 
In[2]:= In[2]:= 
In[3]:= 
Out[3]= {64}

In[4]:= In[4]:= In[4]:= In[4]:= In[4]:= 
In[5]:= The purpose of this script is to determine whether Mathematica has been\
 
>   correctly configured on the system. The need for this test is driven by\
 
>   some unexpected poor performace on CSD3 jobs.

In[6]:= The variable $MaxLicenseProcesses is set to 13

In[7]:= The protected variable $ProcessorCount is set to 64

In[8]:= The variable $KernelCount is set to 0

In[9]:= In[9]:= In[9]:= 
In[10]:= Now we execute LaunchKernels[]

In[11]:= 
In[12]:= The variable $KernelCount is set to 64

In[13]:= It takes 1.01083 seconds to wait for 1 seconds for 1 times in parallel.
It takes 1.01354 seconds to wait for 1 seconds for 2 times in parallel.
It takes 1.01589 seconds to wait for 1 seconds for 3 times in parallel.
It takes 1.00459 seconds to wait for 1 seconds for 4 times in parallel.
It takes 1.00587 seconds to wait for 1 seconds for 5 times in parallel.
It takes 1.00809 seconds to wait for 1 seconds for 6 times in parallel.
It takes 1.00828 seconds to wait for 1 seconds for 7 times in parallel.
It takes 1.01427 seconds to wait for 1 seconds for 8 times in parallel.
It takes 1.01585 seconds to wait for 1 seconds for 9 times in parallel.
It takes 1.01508 seconds to wait for 1 seconds for 10 times in parallel.
It takes 1.01626 seconds to wait for 1 seconds for 11 times in parallel.
It takes 1.0075 seconds to wait for 1 seconds for 12 times in parallel.
It takes 1.00751 seconds to wait for 1 seconds for 13 times in parallel.
It takes 1.00953 seconds to wait for 1 seconds for 14 times in parallel.
It takes 1.01024 seconds to wait for 1 seconds for 15 times in parallel.
It takes 1.01066 seconds to wait for 1 seconds for 16 times in parallel.
It takes 1.01128 seconds to wait for 1 seconds for 17 times in parallel.
It takes 1.01375 seconds to wait for 1 seconds for 18 times in parallel.
It takes 1.01501 seconds to wait for 1 seconds for 19 times in parallel.
It takes 1.01656 seconds to wait for 1 seconds for 20 times in parallel.
It takes 1.01874 seconds to wait for 1 seconds for 21 times in parallel.
It takes 1.01922 seconds to wait for 1 seconds for 22 times in parallel.
It takes 1.02017 seconds to wait for 1 seconds for 23 times in parallel.
It takes 1.01146 seconds to wait for 1 seconds for 24 times in parallel.
It takes 1.01168 seconds to wait for 1 seconds for 25 times in parallel.
It takes 1.01405 seconds to wait for 1 seconds for 26 times in parallel.
It takes 1.0128 seconds to wait for 1 seconds for 27 times in parallel.
It takes 1.01444 seconds to wait for 1 seconds for 28 times in parallel.
It takes 1.0139 seconds to wait for 1 seconds for 29 times in parallel.
It takes 1.01698 seconds to wait for 1 seconds for 30 times in parallel.
It takes 1.01721 seconds to wait for 1 seconds for 31 times in parallel.
It takes 1.01944 seconds to wait for 1 seconds for 32 times in parallel.
It takes 1.02041 seconds to wait for 1 seconds for 33 times in parallel.
It takes 1.02304 seconds to wait for 1 seconds for 34 times in parallel.
It takes 1.02438 seconds to wait for 1 seconds for 35 times in parallel.
It takes 1.01466 seconds to wait for 1 seconds for 36 times in parallel.
It takes 1.01474 seconds to wait for 1 seconds for 37 times in parallel.
It takes 1.01715 seconds to wait for 1 seconds for 38 times in parallel.
It takes 1.01672 seconds to wait for 1 seconds for 39 times in parallel.
It takes 1.01961 seconds to wait for 1 seconds for 40 times in parallel.
It takes 1.01996 seconds to wait for 1 seconds for 41 times in parallel.
It takes 1.01973 seconds to wait for 1 seconds for 42 times in parallel.
It takes 1.02069 seconds to wait for 1 seconds for 43 times in parallel.
It takes 1.02286 seconds to wait for 1 seconds for 44 times in parallel.
It takes 1.02453 seconds to wait for 1 seconds for 45 times in parallel.
It takes 1.02628 seconds to wait for 1 seconds for 46 times in parallel.
It takes 1.02672 seconds to wait for 1 seconds for 47 times in parallel.
It takes 1.02827 seconds to wait for 1 seconds for 48 times in parallel.
It takes 1.02661 seconds to wait for 1 seconds for 49 times in parallel.
It takes 1.02877 seconds to wait for 1 seconds for 50 times in parallel.
It takes 1.01821 seconds to wait for 1 seconds for 51 times in parallel.
It takes 1.01888 seconds to wait for 1 seconds for 52 times in parallel.
It takes 1.02172 seconds to wait for 1 seconds for 53 times in parallel.
It takes 1.02108 seconds to wait for 1 seconds for 54 times in parallel.
It takes 1.022 seconds to wait for 1 seconds for 55 times in parallel.
It takes 1.02341 seconds to wait for 1 seconds for 56 times in parallel.
It takes 1.02545 seconds to wait for 1 seconds for 57 times in parallel.
It takes 1.03064 seconds to wait for 1 seconds for 58 times in parallel.
It takes 1.0313 seconds to wait for 1 seconds for 59 times in parallel.
It takes 1.03077 seconds to wait for 1 seconds for 60 times in parallel.
It takes 1.03157 seconds to wait for 1 seconds for 61 times in parallel.
It takes 1.02298 seconds to wait for 1 seconds for 62 times in parallel.
It takes 1.03372 seconds to wait for 1 seconds for 63 times in parallel.
It takes 1.02164 seconds to wait for 1 seconds for 64 times in parallel.
It takes 2.00934 seconds to wait for 1 seconds for 65 times in parallel.
It takes 2.01055 seconds to wait for 1 seconds for 66 times in parallel.
It takes 2.02234 seconds to wait for 1 seconds for 67 times in parallel.
It takes 2.0137 seconds to wait for 1 seconds for 68 times in parallel.
It takes 2.01309 seconds to wait for 1 seconds for 69 times in parallel.
It takes 2.01365 seconds to wait for 1 seconds for 70 times in parallel.
It takes 2.03142 seconds to wait for 1 seconds for 71 times in parallel.
It takes 2.02178 seconds to wait for 1 seconds for 72 times in parallel.
It takes 2.01832 seconds to wait for 1 seconds for 73 times in parallel.
It takes 2.01952 seconds to wait for 1 seconds for 74 times in parallel.
It takes 2.01429 seconds to wait for 1 seconds for 75 times in parallel.
It takes 2.01416 seconds to wait for 1 seconds for 76 times in parallel.
It takes 2.01709 seconds to wait for 1 seconds for 77 times in parallel.
It takes 2.02712 seconds to wait for 1 seconds for 78 times in parallel.
It takes 2.02981 seconds to wait for 1 seconds for 79 times in parallel.
It takes 2.03119 seconds to wait for 1 seconds for 80 times in parallel.
It takes 2.03252 seconds to wait for 1 seconds for 81 times in parallel.
It takes 2.03174 seconds to wait for 1 seconds for 82 times in parallel.
It takes 2.01169 seconds to wait for 1 seconds for 83 times in parallel.
It takes 2.03466 seconds to wait for 1 seconds for 84 times in parallel.
It takes 2.02579 seconds to wait for 1 seconds for 85 times in parallel.
It takes 2.03113 seconds to wait for 1 seconds for 86 times in parallel.
It takes 2.02417 seconds to wait for 1 seconds for 87 times in parallel.
It takes 2.02449 seconds to wait for 1 seconds for 88 times in parallel.
It takes 2.02683 seconds to wait for 1 seconds for 89 times in parallel.
It takes 2.0249 seconds to wait for 1 seconds for 90 times in parallel.
It takes 2.02375 seconds to wait for 1 seconds for 91 times in parallel.
It takes 2.02674 seconds to wait for 1 seconds for 92 times in parallel.
It takes 2.02717 seconds to wait for 1 seconds for 93 times in parallel.
It takes 2.02748 seconds to wait for 1 seconds for 94 times in parallel.
It takes 2.02833 seconds to wait for 1 seconds for 95 times in parallel.
It takes 2.02947 seconds to wait for 1 seconds for 96 times in parallel.
It takes 2.02828 seconds to wait for 1 seconds for 97 times in parallel.
It takes 2.02999 seconds to wait for 1 seconds for 98 times in parallel.
It takes 2.03218 seconds to wait for 1 seconds for 99 times in parallel.
It takes 2.03225 seconds to wait for 1 seconds for 100 times in parallel.
It takes 2.02526 seconds to wait for 1 seconds for 101 times in parallel.
It takes 2.02508 seconds to wait for 1 seconds for 102 times in parallel.
It takes 2.02664 seconds to wait for 1 seconds for 103 times in parallel.
It takes 2.02648 seconds to wait for 1 seconds for 104 times in parallel.
It takes 2.0274 seconds to wait for 1 seconds for 105 times in parallel.
It takes 2.0266 seconds to wait for 1 seconds for 106 times in parallel.
It takes 2.03016 seconds to wait for 1 seconds for 107 times in parallel.
It takes 2.02802 seconds to wait for 1 seconds for 108 times in parallel.
It takes 2.03063 seconds to wait for 1 seconds for 109 times in parallel.
It takes 2.03069 seconds to wait for 1 seconds for 110 times in parallel.
It takes 2.03098 seconds to wait for 1 seconds for 111 times in parallel.
It takes 2.02917 seconds to wait for 1 seconds for 112 times in parallel.
It takes 2.03173 seconds to wait for 1 seconds for 113 times in parallel.
It takes 2.03267 seconds to wait for 1 seconds for 114 times in parallel.
It takes 2.03506 seconds to wait for 1 seconds for 115 times in parallel.
It takes 2.03602 seconds to wait for 1 seconds for 116 times in parallel.
It takes 2.03547 seconds to wait for 1 seconds for 117 times in parallel.
It takes 2.03519 seconds to wait for 1 seconds for 118 times in parallel.
It takes 2.03653 seconds to wait for 1 seconds for 119 times in parallel.
It takes 2.03005 seconds to wait for 1 seconds for 120 times in parallel.
It takes 2.03131 seconds to wait for 1 seconds for 121 times in parallel.
It takes 2.03117 seconds to wait for 1 seconds for 122 times in parallel.
It takes 2.03232 seconds to wait for 1 seconds for 123 times in parallel.
It takes 2.03097 seconds to wait for 1 seconds for 124 times in parallel.
It takes 2.03407 seconds to wait for 1 seconds for 125 times in parallel.
It takes 2.03461 seconds to wait for 1 seconds for 126 times in parallel.
It takes 2.03472 seconds to wait for 1 seconds for 127 times in parallel.
It takes 2.03333 seconds to wait for 1 seconds for 128 times in parallel.
It takes 3.02467 seconds to wait for 1 seconds for 129 times in parallel.
It takes 3.02352 seconds to wait for 1 seconds for 130 times in parallel.
It takes 3.02788 seconds to wait for 1 seconds for 131 times in parallel.
It takes 3.0282 seconds to wait for 1 seconds for 132 times in parallel.
It takes 3.01994 seconds to wait for 1 seconds for 133 times in parallel.
It takes 3.01866 seconds to wait for 1 seconds for 134 times in parallel.
It takes 3.0221 seconds to wait for 1 seconds for 135 times in parallel.
It takes 3.02468 seconds to wait for 1 seconds for 136 times in parallel.
It takes 3.02612 seconds to wait for 1 seconds for 137 times in parallel.
It takes 3.02831 seconds to wait for 1 seconds for 138 times in parallel.
It takes 3.02885 seconds to wait for 1 seconds for 139 times in parallel.
It takes 3.03275 seconds to wait for 1 seconds for 140 times in parallel.
It takes 3.03082 seconds to wait for 1 seconds for 141 times in parallel.
It takes 3.02315 seconds to wait for 1 seconds for 142 times in parallel.
It takes 3.02284 seconds to wait for 1 seconds for 143 times in parallel.
It takes 3.02679 seconds to wait for 1 seconds for 144 times in parallel.
It takes 3.02819 seconds to wait for 1 seconds for 145 times in parallel.
It takes 3.02987 seconds to wait for 1 seconds for 146 times in parallel.
It takes 3.03155 seconds to wait for 1 seconds for 147 times in parallel.
It takes 3.03003 seconds to wait for 1 seconds for 148 times in parallel.
It takes 3.03388 seconds to wait for 1 seconds for 149 times in parallel.
It takes 3.03594 seconds to wait for 1 seconds for 150 times in parallel.
It takes 3.03446 seconds to wait for 1 seconds for 151 times in parallel.
It takes 3.03686 seconds to wait for 1 seconds for 152 times in parallel.
It takes 3.03581 seconds to wait for 1 seconds for 153 times in parallel.
It takes 3.0262 seconds to wait for 1 seconds for 154 times in parallel.
It takes 3.0322 seconds to wait for 1 seconds for 155 times in parallel.
It takes 3.03116 seconds to wait for 1 seconds for 156 times in parallel.
It takes 3.02899 seconds to wait for 1 seconds for 157 times in parallel.
It takes 3.03073 seconds to wait for 1 seconds for 158 times in parallel.
It takes 3.03762 seconds to wait for 1 seconds for 159 times in parallel.
It takes 3.03777 seconds to wait for 1 seconds for 160 times in parallel.
It takes 3.03951 seconds to wait for 1 seconds for 161 times in parallel.
It takes 3.04004 seconds to wait for 1 seconds for 162 times in parallel.
It takes 3.04219 seconds to wait for 1 seconds for 163 times in parallel.
It takes 3.04435 seconds to wait for 1 seconds for 164 times in parallel.
It takes 3.03933 seconds to wait for 1 seconds for 165 times in parallel.
It takes 3.04016 seconds to wait for 1 seconds for 166 times in parallel.
It takes 3.03954 seconds to wait for 1 seconds for 167 times in parallel.
It takes 3.03323 seconds to wait for 1 seconds for 168 times in parallel.
It takes 3.03643 seconds to wait for 1 seconds for 169 times in parallel.
It takes 3.03703 seconds to wait for 1 seconds for 170 times in parallel.
It takes 3.0386 seconds to wait for 1 seconds for 171 times in parallel.
It takes 3.03853 seconds to wait for 1 seconds for 172 times in parallel.
It takes 3.04147 seconds to wait for 1 seconds for 173 times in parallel.
It takes 3.03955 seconds to wait for 1 seconds for 174 times in parallel.
It takes 3.04393 seconds to wait for 1 seconds for 175 times in parallel.
It takes 3.04169 seconds to wait for 1 seconds for 176 times in parallel.
It takes 3.04697 seconds to wait for 1 seconds for 177 times in parallel.
It takes 3.04818 seconds to wait for 1 seconds for 178 times in parallel.
It takes 3.04274 seconds to wait for 1 seconds for 179 times in parallel.
It takes 3.04442 seconds to wait for 1 seconds for 180 times in parallel.
It takes 3.04252 seconds to wait for 1 seconds for 181 times in parallel.
It takes 3.03971 seconds to wait for 1 seconds for 182 times in parallel.
It takes 3.03841 seconds to wait for 1 seconds for 183 times in parallel.
It takes 3.04085 seconds to wait for 1 seconds for 184 times in parallel.
It takes 3.04317 seconds to wait for 1 seconds for 185 times in parallel.
It takes 3.04453 seconds to wait for 1 seconds for 186 times in parallel.
It takes 3.04213 seconds to wait for 1 seconds for 187 times in parallel.
It takes 3.04355 seconds to wait for 1 seconds for 188 times in parallel.
It takes 3.04268 seconds to wait for 1 seconds for 189 times in parallel.
It takes 3.05066 seconds to wait for 1 seconds for 190 times in parallel.
It takes 3.04997 seconds to wait for 1 seconds for 191 times in parallel.
It takes 3.04823 seconds to wait for 1 seconds for 192 times in parallel.
It takes 4.03543 seconds to wait for 1 seconds for 193 times in parallel.
It takes 4.04079 seconds to wait for 1 seconds for 194 times in parallel.
It takes 4.03439 seconds to wait for 1 seconds for 195 times in parallel.
It takes 4.04408 seconds to wait for 1 seconds for 196 times in parallel.
It takes 4.03874 seconds to wait for 1 seconds for 197 times in parallel.
It takes 4.04862 seconds to wait for 1 seconds for 198 times in parallel.
It takes 4.03251 seconds to wait for 1 seconds for 199 times in parallel.
It takes 4.04185 seconds to wait for 1 seconds for 200 times in parallel.

In[14]:= sbatch-INFO: we're done
St lis  8 11:36:38 CET 2023
